# Taps
tap 'homebrew/cask'
tap 'homebrew/cask-fonts'
tap 'homebrew/cask-versions'
#tap 'dart-lang/dart'
tap 'homebrew/bundle'
tap 'homebrew/cask-drivers'
tap 'sambadevi/powerlevel9k'

# Binaries
brew 'ack'
#brew 'awscli'
brew 'bash' # Latest bash version
brew 'bat'
brew 'coreutils' # Those that come with macOS are outdated
brew 'emacs'
brew 'gh'
brew 'git'
brew 'git-flow-avh' # updated version of https://github.com/nvie/gitflow
#brew 'gnupg2'
brew 'grep'
brew 'mackup'
brew 'mas'
brew 'pkg-config' # https://github.com/driesvints/dotfiles/issues/20
brew 'powerlevel9k'
brew 'putty'
brew 'sshuttle'
brew 'svn' # needed to install certain casks/formulae
brew 'trash'
brew 'tree'
brew 'wget'
#brew 'zsh'
#brew 'zsh-completions'

# Development
#brew 'cocoapods'
#brew 'dart'
#brew 'php'
#brew 'imagick'
#brew 'mysql'
#brew 'nginx'
#brew 'node'
#brew 'rbenv'
#brew 'redis'
#brew 'ruby-build'

# Apps
#cask 'aerial' # https://github.com/JohnCoates/Aerial
cask 'adguard'
cask 'alfred' # https://www.alfredapp.com
#cask 'android-studio'
cask 'appcleaner'
cask 'audacity'
cask 'barrier' # synergy fork
#cask 'brave-browser'
#cask 'brooklyn' # https://github.com/pedrommcarrasco/Brooklyn
cask 'caffeine' # http://lightheadsw.com/caffeine
cask 'carbon-copy-cloner'
cask 'clamxav'
#cask 'dbeaver-community'
#cask 'discord'
#cask 'docker'
#cask 'dotnet-sdk'
#cask 'dropbox'
cask 'figma'
cask 'firefox'
cask 'github'
#cask 'google-backup-and-sync'
cask 'google-chrome'
cask 'insomnia'
#cask 'iterm2'
#cask 'java'
cask 'keybase'
#cask 'logitech-control-center'
cask 'logitech-options'
cask 'logitech-g-hub'
#cask 'meld'
cask 'macx-youtube-downloader'
#cask 'microsoft-teams'
#cask 'sequel-pro' # https://www.sequelpro.com
cask 'signal'
#cask 'skype'
cask 'sourcetree'
cask 'sublime-text'
#cask 'there' # http://there.pm
#cask 'transmit' # http://panic.com
#cask 'vagrant'
#cask 'virtualbox'
#cask 'virtualbox-extension-pack'
#cask 'visual-studio'
#cask 'visual-studio-code'
#cask 'vivaldi'
cask 'vlc'
#cask 'zeplin'
cask 'zoom'

# Quicklook
cask 'betterzip'
cask 'provisionql' # ipa files
cask 'qlimagesize'
cask 'qlmarkdown'
cask 'qlstephen' # various README, etc.
cask 'qlswift'
cask 'quicklook-json'
cask 'quicklook-csv'
cask 'suspicious-package' # .pkg files
cask 'syntax-highlight'

# Fonts
cask 'font-cascadia-code-pl'
cask 'font-fira-code'
cask 'font-fira-mono'
cask 'font-fira-code-nerd-font'
cask 'font-fira-mono-nerd-font'
cask 'font-lato'
cask 'font-open-sans'
cask 'font-poppins'
cask 'font-roboto'
#cask 'font-source-code-pro-for-powerline'
#cask 'font-source-code-pro'
#cask 'font-source-sans-pro'
#cask 'font-source-serif-pro'

# Mac App Store
#mas 'Apple Configurator 2', id: 1037126344
mas 'Bitwarden', id: 1352778147
mas 'Boop', id: 1518425043
mas 'DevCleaner for Xcode', id: 1388020431
mas 'Dynamo', id: 1445910651
mas 'Flycut', id: 442160987
#mas 'Giphy Capture', id: 668208984
mas 'Keynote', id: 409183694
mas 'LanScan', id: 472226235
#mas 'LastPass Password Manager', id: 926036361
mas 'Magnet', id: 441258766
mas 'Microsoft Remote Desktop', id: 1295203466
mas 'Numbers', id: 409203825
mas 'Pages', id: 409201541
#mas 'Spark', id: 1176895641
mas 'The Unarchiver', id: 425424353
mas 'Trello', id: 1278508951
#mas 'Tweetbot', id: 1384080005
